{
    "categories": ["certainty", "variety", "significance", "love-and-connection", "growth", "contribution"],
    "allValues": [
        {
            "id": "certainty",
            "name": "Certainty",
            "description": "stability, orderliness, predictability",
            "definition": "Stabilization allows you to feel comfortable and safe. People who value certainty do not like to be surprised and prefer a predictable lifestyle. The reality they create is their asylum and provides peace of mind.",
            "category": "certainty"
        },
        {
            "id": "control",
            "name": "Control",
            "description": "control of the situation or environment",
            "definition": "People who value control, like to be masters of the situation. No matter what happens, they are ready to make decisions. They are also ready to take responsibility for their actions. Interest in control can arise from a person's need for security or ambition.",
            "category": "certainty"
        },
        {
            "id": "security",
            "name": "Security",
            "description": "being free from danger or threat",
            "definition": "The value of security comes from our primary needs. The sense of security allows you to feel comfortable and opens the possibility of further development. People in need of security can do a lot to avoid danger.",
            "category": "certainty"
        },
        {
            "id": "peace",
            "name": "Peace",
            "description": "calm, freedom from conflict",
            "definition": "People who value peace tend to avoid conflicts. If they engage in disputes, it is mainly to help resolve them. They are willing to make compromises and sacrifices if it is required to regain peace.",
            "category": "certainty"
        },
        {
            "id": "health",
            "name": "Health",
            "description": "well-being, fitness, not being sick",
            "definition": "Those who value health take conscious actions to maintain physical and mental fitness. They do not shy away from practicing sports and are happy to follow a healthy diet. They are aware of the consequences of insufficient health care.",
            "category": "certainty"
        },
        {
            "id": "discipline",
            "name": "Discipline",
            "description": "obedience, self-control",
            "definition": "It is the ability to subordinate one's actions to the realization of a long-term plan. Disciplined people always have a goal in mind. They are also aware of how much they can achieve with their work and persistence if they really want something.",
            "category": "certainty"
        },
        {
            "id": "job-security",
            "name": "Job security",
            "description": "not worrying about losing your job",
            "definition": "Having a job gives you not only a salary, but also a certain social status. It also determines the role we play in society and our immediate surroundings. Employment security is for many people the foundation on which they build their lifestyle.",
            "category": "certainty"
        },
        {
            "id": "wealth",
            "name": "Wealth",
            "description": "money, material goods, luxury lifestyle",
            "definition": "Wealth can strongly affect the imagination. It allows us to feel comfortable, safe and exceptional. Although it does not guarantee finding true happiness, it gives a chance to discover the charms of life in any chosen way.",
            "category": "certainty"
        },
        {
            "id": "financial-stability",
            "name": "Financial stability",
            "description": "stable income, financial freedom",
            "definition": "For people who value financial stability, money is important, but not the most important. It is a medium of exchange and is needed to fulfill your own needs and dreams. It is not an end in itself, but only an instrument needed to achieve it.",
            "category": "certainty"
        },
        {
            "id": "pleasure",
            "name": "Pleasure",
            "description": "enjoyment, happiness, satisfaction",
            "definition": "Everyone finds pleasure in something different. Indulging in pleasure allows you to break away from your daily routine. These are the moments when we can feel fulfilled. This is when we renew our energy for the next actions.",
            "category": "certainty"
        },
        {
            "id": "tradition",
            "name": "Tradition",
            "description": "respecting customs, practicing rites",
            "definition": "Recognition of tradition means respect for customs and rituals practiced by older generations. Attachment to tradition may result from the need for constancy or belonging. Tradition is often associated with the religion professed.",
            "category": "certainty"
        },
        {
            "id": "trust",
            "name": "Trust",
            "description": "a belief in someone or something",
            "definition": "We all have to rely on something. Sometimes it's family and friends. Sometimes business partners or the government. Trust is a particularly important value because many aspects of our daily life are based on it.",
            "category": "certainty"
        },
        {
            "id": "privacy",
            "name": "Privacy",
            "description": "the right to have secrets, discretion",
            "definition": "In today's world, privacy is still a desired value. Privacy-conscious people only provide information that they want to share publicly. They feel uncomfortable about being watched.",
            "category": "certainty"
        },
        {
            "id": "accountability",
            "name": "Accountability",
            "description": "responsibility, dependability",
            "definition": "Responsibility is a much-appreciated value when talking about relationships with other people. It is important both personally and professionally. We feel safer around people we can rely on. Dependability is often the basis of trust.",
            "category": "certainty"
        },
        {
            "id": "challenge",
            "name": "Challenge",
            "description": "testing your own abilities, competition",
            "definition": "Taking up challenges is often the result of a strong need to test yourself. These are activities that require us to leave our comfort zone and face something new and unknown. They awaken our imagination and shape our character.",
            "category": "variety"
        },
        {
            "id": "adventure",
            "name": "Adventure",
            "description": "looking for exciting and risky activities",
            "definition": "It is a passion for activities that cause excitement. Adventurers are not afraid to take risks. They are eager to explore and learn about the unknown. Their openness allows them to make new friends easily.",
            "category": "variety"
        },
        {
            "id": "variety",
            "name": "Variety",
            "description": "frequent change, diversity",
            "definition": "People who value diversity lead a very varied life, during which they will experience everything that caught their attention even for a moment. In the life of a person who loves diversity, there is only one thing you can be confident about - change.",
            "category": "variety"
        },
        {
            "id": "excitement",
            "name": "Excitement",
            "description": "great enthusiasm, eagerness",
            "definition": "Excitement and enthusiasm can attract people. People with such characteristics are often the spark that initiates many activities. There is always something they are working on or are planning to start. They are not afraid of taking up challenges and adventures.",
            "category": "variety"
        },
        {
            "id": "courage",
            "name": "Courage",
            "description": "fearlessness, bravery",
            "definition": "It's about being ready to follow your heart and acting according to your values. Courageous people are seldom satisfied with compromises. They take what they want from life or are determined to find a way to achieve it.",
            "category": "variety"
        },
        {
            "id": "curiosity",
            "name": "Curiosity",
            "description": "willingness to explore and learn",
            "definition": "Curiosity is one of the traits that have had a huge impact on the shape of our civilization. Searching for answers to intriguing questions, in-depth knowledge of a subject, interest in the surrounding world are the characteristics of people who value curiosity.",
            "category": "variety"
        },
        {
            "id": "creativity",
            "name": "Creativity",
            "description": "imagination, inventiveness",
            "definition": "The imagination of creative people has no limits. They shape the world as we know it. They are never template minded and are not afraid to question the status quo. Creating is their passion, and creativity manifests itself in many aspects of everyday life.",
            "category": "variety"
        },
        {
            "id": "reputation",
            "name": "Reputation",
            "description": "other people's opinion",
            "definition": "Reputation reflects our value in the eyes of others. It has a great influence on how we are treated by our surroundings. It can take a lot of work and effort to achieve the desired reputation, but it will make it easier for us to achieve our goals in relationships with others.",
            "category": "significance"
        },
        {
            "id": "respect",
            "name": "Respect",
            "description": "honour and care shown towards someone",
            "definition": "It is a recognition of someone's achievements or attitude. We respect those people who have had a strong and positive impact on our lives. We often adopt them as role models and are eager to learn from them.",
            "category": "significance"
        },
        {
            "id": "authority",
            "name": "Authority",
            "description": "the right to lead and control",
            "definition": "Power gives great opportunities, but also requires great responsibility. It gives privileges not available to other people. When used wisely, it allows you to achieve ambitious goals. In bad hands, it can turn out to be destructive.",
            "category": "significance"
        },
        {
            "id": "fame",
            "name": "Fame",
            "description": "being known or recognized by many people",
            "definition": "Fame is often desired by people who love to be the center of attention. The desire for fame can come from the need to be popular or the desire to achieve the benefits of recognition.",
            "category": "significance"
        },
        {
            "id": "authenticity",
            "name": "Authenticity",
            "description": "truthfulness, genuineness",
            "definition": "Authentic persons do not have to prove anything to others. They are themselves in every situation. When asked for their opinion, they will give an honest answer, even if their opinion is not popular. They do not find themselves in an environment where lying or lack of honesty often occurs.",
            "category": "significance"
        },
        {
            "id": "beauty",
            "name": "Beauty",
            "description": "aesthetics, attractiveness",
            "definition": "Seeing beauty in the world around us gives a lot of joy. Creating beautiful things is sharing this joy with others. People who appreciate beauty usually like to take care of their appearance. They also pay a lot of attention to the appearance of others.",
            "category": "significance"
        },
        {
            "id": "appreciation",
            "name": "Appreciation",
            "description": "recognition of value or worth",
            "definition": "Appreciation is a significant respect for another person. Being appreciated always requires effort. Appreciation is given to people who have brought a lot of good in other people's lives or achieved something special with their own efforts.",
            "category": "significance"
        },
        {
            "id": "acceptance",
            "name": "Acceptance",
            "description": "being included, approval",
            "definition": "Acceptance is one of the most important human needs. It develops self-confidence and makes us feel that we mean something to others. The need for acceptance can have a strong impact on the decisions we make.",
            "category": "significance"
        },
        {
            "id": "influence",
            "name": "Influence",
            "description": "having effect on people or things",
            "definition": "Having influence allows you to shape the mindset of other people. It is a powerful ability and therefore requires a lot of responsibility. Influencers have a unique chance of doing something good for many people.",
            "category": "significance"
        },
        {
            "id": "popularity",
            "name": "Popularity",
            "description": "being liked or admired by many people",
            "definition": "Being popular is especially important for people who love being in the company of others. It makes you feel liked and important. Popularity makes it easier to use your contacts or make new friends.",
            "category": "significance"
        },
        {
            "id": "uniqueness",
            "name": "Uniqueness",
            "description": "being particularly remarkable or unusual",
            "definition": "Each of us is unique, but some people like to emphasize it. Extraordinary people make the world a much more interesting place. They like to be noticed and they like to surprise. They avoid everything that is common and popular in favor of what is unique and unusual.",
            "category": "significance"
        },
        {
            "id": "love",
            "name": "Love",
            "description": "deep feeling of affection",
            "definition": "Love manifests itself in the interest and care of another person. Depending on who it is addressed to, it can take various forms. It is one of the most important human needs because everyone wants to love and be loved.",
            "category": "love-and-connection"
        },
        {
            "id": "family",
            "name": "Family",
            "description": "caring for loved ones",
            "definition": "Family is a value that meets many of our needs simultaneously. We find love, security, self-esteem and development in it. Taking care of the family we have a great opportunity to positively influence the lives of our loved ones. In return we are generously endowed with love.",
            "category": "love-and-connection"
        },
        {
            "id": "honesty",
            "name": "Honesty",
            "description": "sincerity, frankness",
            "definition": "Honesty is about expressing your true opinion openly. It makes our thoughts and actions coherent. Honesty is based on authenticity, mutual trust and has a huge impact on shaping relationships with other people.",
            "category": "love-and-connection"
        },
        {
            "id": "loyalty",
            "name": "Loyalty",
            "description": "faithfulness",
            "definition": "Loyalty is showing constant support to an individual or organization. Loyal people build their relationships based on trust. They conscientiously keep their commitment and expect the same from the other party.",
            "category": "love-and-connection"
        },
        {
            "id": "forgiveness",
            "name": "Forgiveness",
            "description": "willingness to forgive others",
            "definition": "At the heart of forgiveness lies a deep faith in the goodness of another person. People willing to forgive want to live in harmony. They understand well that we all make mistakes and believe that everyone deserves a second chance.",
            "category": "love-and-connection"
        },
        {
            "id": "compassion",
            "name": "Compassion",
            "description": "empathy, sympathy",
            "definition": "Compassion manifests itself in seeing and understanding the suffering of the other being. People capable of compassion are not indifferent to human problems. When possible, they voluntarily provide help and support.",
            "category": "love-and-connection"
        },
        {
            "id": "friendship",
            "name": "Friendship",
            "description": "comradeship, companionship",
            "definition": "Friendship allows you to enjoy life in the company of kind people. It gives a sense of self-worth, acceptance and belonging. It teaches us to take care of the other person and share what we have to offer.",
            "category": "love-and-connection"
        },
        {
            "id": "growth",
            "name": "Growth",
            "description": "physical, intellectual and spiritual development",
            "definition": "Growth is an integral part of every person's life. The power of development lies in the ability to independently decide on its direction. It allows us to achieve personal desires and become what we want to be.",
            "category": "growth"
        },
        {
            "id": "passion",
            "name": "Passion",
            "description": "a vocation or loved hobby",
            "definition": "Passion is an activity in which we find real pleasure. People with passion are very excited when their interests are discussed. They can talk about them for hours. The effects of their work can be impressive because they put a lot of heart into it.",
            "category": "growth"
        },
        {
            "id": "excellence",
            "name": "Excellence",
            "description": "mastery, perfection",
            "definition": "Excellence is a path that only a few follow. Every day they push their limits to improve their workshop and craftsmanship. Good or very good results are not satisfactory enough for them. The improvement process is as important as the end result itself.",
            "category": "growth"
        },
        {
            "id": "determination",
            "name": "Determination",
            "description": "persistence, perseverance",
            "definition": "It is a constant effort despite numerous difficulties and adversities. Thanks to determination people fulfill their ambitions. It allows them to survive difficult moments and move on in the direction they want to go.",
            "category": "growth"
        },
        {
            "id": "success",
            "name": "Success",
            "description": "achieving desired results",
            "definition": "Success confirms that the right decisions were made and effectively implemented. It contributes to building self-esteem and confidence. Achieving success brings a lot of satisfaction and can be a source of pride.",
            "category": "growth"
        },
        {
            "id": "independence",
            "name": "Independence",
            "description": "self-reliance, self-sufficiency",
            "definition": "Independence gives a sense of security and control. It also creates favourable conditions for growth. Those who value independence are reluctant to give control over their life to someone else.",
            "category": "growth"
        },
        {
            "id": "religion",
            "name": "Religion",
            "description": "devoutness, faith",
            "definition": "Religion helps in finding the answer to the question about the meaning of life. Religious people often try to take an active part in the life of the local community centered around their religion, which allows them to experience a strong sense of belonging.",
            "category": "growth"
        },
        {
            "id": "wisdom",
            "name": "Wisdom",
            "description": "making good decisions and judgements",
            "definition": "Wisdom comes from the knowledge and experience gained in life. It allows to objectively assess the situation and make the right choices. It is also a mature way of looking at the world and other people.",
            "category": "growth"
        },
        {
            "id": "intelligence",
            "name": "Intelligence",
            "description": "logical thinking, quick learning",
            "definition": "Intelligent people are guided by logic when making decisions. They are able to assess the situation well and prefer to rely on their own opinions. They are careful with the ideas and advice given to them. Intelligence makes it easier to adapt quickly to a changing situation.",
            "category": "growth"
        },
        {
            "id": "competence",
            "name": "Competence",
            "description": "capability, expertise, skill",
            "definition": "Competence is a high level of knowledge and skills in a given field. Competent people put a lot of effort into ensuring that the quality of their work meets the highest expectations. They are aware of the need for continuous self-improvement.",
            "category": "growth"
        },
        {
            "id": "spirituality",
            "name": "Spirituality",
            "description": "focusing on intangible aspects of life",
            "definition": "Spirituality makes us focus a lot of our attention on immaterial reality. It is a constant search for the meaning of life. It evolves with our inner development and the subsequent stages of life.",
            "category": "growth"
        },
        {
            "id": "inner-harmony",
            "name": "Inner harmony",
            "description": "balance, self-fulfilment",
            "definition": "Internal harmony and balance allow you to find relief in the hustle and bustle of the surrounding world. Thanks to them, we can still enjoy small things. Self-awareness is an important element on the way to achieving inner balance.",
            "category": "growth"
        },
        {
            "id": "ambition",
            "name": "Ambition",
            "description": "aspiration, strong desire to succeed",
            "definition": "Ambition comes from a strong self-esteem. It manifests itself in setting goals that are difficult to achieve and their consistent realization. Ambitious people build their image through their own achievements.",
            "category": "growth"
        },
        {
            "id": "contribution",
            "name": "Contribution",
            "description": "helping others to achieve a common goal",
            "definition": "Making your own contribution gives satisfaction from participating in something important and needed by other people. It gives an opportunity to leave something valuable behind. It positively influences self-esteem and life satisfaction.",
            "category": "contribution"
        },
        {
            "id": "equality",
            "name": "Equality",
            "description": "equal rights and opportunities for all",
            "definition": "It is a belief that we all deserve equal rights and opportunities. Equality is to protect us from injustice and exclusion. Ensuring equality does not come easily and requires breaking down many barriers.",
            "category": "contribution"
        },
        {
            "id": "justice",
            "name": "Justice",
            "description": "fairness, integrity",
            "definition": "Social order is based on justice and honesty. Righteous people follow precisely defined principles in their lives. They expect the same from others. They generally have a very well-developed sense of morality.",
            "category": "contribution"
        },
        {
            "id": "meaningful-work",
            "name": "Meaningful work",
            "description": "positive impact on other people's lives",
            "definition": "Having a valuable job allows you to positively influence the lives of others. It gives a sense of being needed and useful to society. Seeing the value in your work gives you a lot of energy to act and avoids professional burnout.",
            "category": "contribution"
        },
        {
            "id": "teamwork",
            "name": "Teamwork",
            "description": "collaboration, synergy",
            "definition": "Teamwork proves that more can be achieved by working with others than by acting alone. This is a key value for people working on very complex projects. Team problem solving allows you to achieve goals more efficiently.",
            "category": "contribution"
        },
        {
            "id": "tolerance",
            "name": "Tolerance",
            "description": "acceptance, openness, open-mindedness",
            "definition": "It is respect for other people, regardless of their views and lifestyle. The basis of tolerance is awareness of your own worth. People with open minds are not afraid of being different, and see value in diversity.",
            "category": "contribution"
        },
        {
            "id": "commitment",
            "name": "Commitment",
            "description": "engagement, support",
            "definition": "Commitment and involvement are very important values in working with other people. They build the image of a good employee and allow you to gain trust and respect. We are most willing to engage in things that are close to us and in line with our values.",
            "category": "contribution"
        },
        {
            "id": "ethics",
            "name": "Ethics",
            "description": "moral behavior",
            "definition": "People who value ethics often stand guard over morality. They actively oppose unethical actions and are able to assess the situation well through a broader perspective. They are excellent at making objective judgments.",
            "category": "contribution"
        },
        {
            "id": "helpfulness",
            "name": "Helpfulness",
            "description": "benevolence, service, altruism",
            "definition": "Altruists put other people’s needs above their own. They devote a large part of their lives to helping those in need. Thanks to their sensitivity and empathy they are not indifferent to the problems of others.",
            "category": "contribution"
        },
        {
            "id": "freedom",
            "name": "Freedom",
            "description": "liberty, freedom of action and thought",
            "definition": "It is free will, which can freely manifest itself in actions taken and opinions expressed. People who value freedom want to live according to their own beliefs and principles. They do not like limitations and patterns.",
            "category": "contribution"
        }
    ]

}